      ******************************************************************
      * Author: David Aragon
      * Date:
      * Purpose: Aprender-1
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "lo primero que escribo"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
